<b> Pandas Basics <b>

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.1.3'

<b> Series <b>

In [6]:
my_dict = { "one" : [1,2,3,5]}

In [7]:
my_dict

{'one': [1, 2, 3, 5]}

In [8]:
type(my_dict)

dict

In [13]:
my_series = pd.Series(my_dict)

In [14]:
type(my_series)

pandas.core.series.Series

In [16]:
a1 = np.random.randint(5,size=10)
series = pd.Series(a1)

In [17]:
a1

array([3, 1, 4, 0, 3, 4, 4, 3, 3, 4])

In [18]:
type(series)

pandas.core.series.Series

In [19]:
series

0    3
1    1
2    4
3    0
4    3
5    4
6    4
7    3
8    3
9    4
dtype: int32

In [22]:
a1 = np.random.randint(5,size=5)
series1 = pd.Series(a1, index=['a','b','c','d','e'])
series1

a    3
b    4
c    4
d    2
e    0
dtype: int32

In [23]:
series1['a']

3

In [24]:
series

0    3
1    1
2    4
3    0
4    3
5    4
6    4
7    3
8    3
9    4
dtype: int32

In [25]:
my_series

one    [1, 2, 3, 5]
dtype: object

In [26]:
my_dict

{'one': [1, 2, 3, 5]}

In [27]:
series = pd.Series(my_dict)

In [28]:
type(series)

pandas.core.series.Series

In [29]:
series

one    [1, 2, 3, 5]
dtype: object

<b> Data frame <b>

In [30]:
my_new_dict = { "id ": [1,2,3,4],
         "name" : ["a","b","c","d"]
       }
my_new_dict

{'id ': [1, 2, 3, 4], 'name': ['a', 'b', 'c', 'd']}

In [33]:
df = pd.DataFrame(my_new_dict)

In [34]:
df

   id  name
0    1    a
1    2    b
2    3    c
3    4    d

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df.columns

Index(['id ', 'name'], dtype='object')

In [37]:
df.dtypes

id       int64
name    object
dtype: object

In [38]:
s1 = pd.Series([1,2,3,4], name="id")
s2 = pd.Series(['a','b','c','d'], name="name")
s3 = pd.Series([1.2,3.6,15,20.9], name="Exp")

In [39]:
series = [s1,s2,s3]

In [41]:
df = pd.DataFrame(series)
df

        0    1   2     3
id      1    2   3     4
name    a    b   c     d
Exp   1.2  3.6  15  20.9

In [42]:
df.T

  id name   Exp
0  1    a   1.2
1  2    b   3.6
2  3    c    15
3  4    d  20.9

<b> Reading files using pandas <b>

In [43]:
df = pd.read_csv("students.csv")

In [44]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [45]:
type(df)

pandas.core.frame.DataFrame

In [46]:
df_excel = pd.read_excel("students.xlsx")
df_excel

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [47]:
type(df_excel)

pandas.core.frame.DataFrame

In [48]:
df_excel.to_csv("my_newdataframeexport.csv")

In [49]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [50]:
name = df["name"]

In [51]:
name

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [52]:
type(name)

pandas.core.series.Series

In [53]:
df.name

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [54]:
list_of_columns = ["id", "name", "compre"]
extracted_data = df[list_of_columns]
extracted_data

   id    name  compre
0   1  pravin      34
1   2   patil       4
2   3    john      33
3   4   sadiq      11
4   5  pravin      34

In [56]:
df.head(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4

In [57]:
df.tail(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [58]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [59]:
df.iloc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [61]:
df.iloc[0,0]

1

In [63]:
df.loc[0,"name"]

'pravin'

In [64]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [65]:
df[df.quiz1 > 3]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [66]:
df[ (df.quiz1 > 3) & (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
4   5  pravin      5      5          10      22      34

In [67]:
df.query('quiz1 > 3')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34